# 0x25-广度优先搜索-Bloxorz

## 题目描述

小汤姆喜欢玩游戏。有一天，他下载了一个名为“ Bloxorz”的小型电脑游戏，这使他兴奋。这是一个将盒子滚动到特殊平面上特定位置的游戏。    
确切地说，由几个单位单元组成的平面是一个矩形区域。由两个完全对齐的单位立方体组成的盒子可以躺下并占据两个相邻的单元格，也可以站起来并占据一个单个单元格。可以通过在地面上拾取盒子的四个边缘之一并将盒子围绕该边缘滚动90度来移动盒子，这算作一招。     
单元共有三种，硬地，易碎地面和禁地。          
硬地可以支撑盒子的全部重量，因此它可以是盒子所在的两个单元之一，也可以是盒子完全站立的单元。      
易碎地面只能支撑盒子重量的一半，      
禁地不能支持任何重量。     
游戏的目标是以最小的移动将站立的盒子滚动到域内上唯一的终点.

小汤姆通过游戏的几个阶段后，他发现这比他预期的要难得多。所以他求助于您。


## 输入格式

输入包含多个测试用例。    
每个测试用例都是游戏的一个阶段。    
它以两个整数R和C（3≤R，C≤500）开头，代表该平面包含R行和每行C个字符，终点为'O'，起点为'X'。     
"."为硬地，“＃”表示禁地，“ E”表示易碎地面。   
一个测试用例以两个零开始，结束输入。

它保证

- 只有一个“ O”。
- 在一个平面中有一个“ X”或相邻的两个“ X”。
- 第一行（和最后一行）（和列）必须为“＃”（空单元格）。
-  'O'和'X'覆盖的单元格都是硬地。

## 输出格式

对于每个测试用例，如果无法实现目标，则输出一行最少的行数或“Impossible”（不带引号）。 　



## 时空限制

时间限制: 1000 ms
内存限制: 64 MB
