# 黎曼几何（riemannian）

## 题目描述

你在桌子上画了三个圈，这三个圈顺时针编号为 $1,2,3$。首先，你将 $n$ 枚硬币全部垒放在 $1$ 号圈里面。这些硬币从下到上面值依次为 $n,n-1,\dots,1$。你每次将某一个圈里面值最小的硬币移动到顺时针相邻的下一个圈里 (即 $1\to2,2\to3,3\to1$)。并且，你需要保证，目标圈里的所有硬币都比你移动的这个硬币的面值大。这样的一次操作称为“一步”。

为了不让老师察觉到你的行为，你决定尽快将这些硬币全部移动到某一个格子。由于你还没有想好移动到哪个格子可以更快完成，你决定先计算出移动到 $2$ 号格子和 $3$ 号格子格子需要的最少步数。

## 输入格式

第一行一个正整数 $t$，代表数据组数。

接下来共 $t$ 行，每一行一个正整数 $n$，代表硬币的总数。

## 输出格式

假设对于第 $i$ 组数据，将所有硬币移动到第 $2$ 个圈的最小步数为 $a_i$，移动到第 $3$ 个圈上的最小步数为 $b_i$。

请输出一行两个整数，分别为 $\bigoplus_{i=1}^t(a_i\bmod 998244353)$，$\bigoplus_{i=1}^t(b_i\bmod 998244353)$。

## 提示

对于所有数据点，$n\le10^{12},t\le1.2\times10^6$。

## 时空限制

时间限制: 1000 ms
内存限制: 512 MB
