# IO 交互不能 Hack

## 题目描述

这是一道交互题。

有两种操作。

初始 $cur = 1$。

操作 1：程序输出 $1$，使得 `cur++;` 

操作 2：程序输出 $0$，此时若 $cur = 0$，则通过本题。

若程序输出不为 $1$ 或 $0$，则忽视此操作。

由于洛谷不支持 BF++ 语言，请提交一个运行后输出你的 BF++ 语言代码的程序。

你的被分配到了 $60000$ 个格子，其中 $30000$ 个用于内存条，$30000$ 个用于迭代条。

内存分配如下图。

![](https://cdn.luogu.com.cn/upload/image_hosting/ps72x0vy.png)

**注意**，同时修改“其他”中的两个单元会导致 RE。（防止有人乱搞把所有内存全部置 $0$）

## 输出格式

以 $0$ 结尾，代表结束答题。

此时若 $cur = 0$，则通过本题。

此时若 $cur \neq 0$，则判错。

若输出 $0$ 时，你的程序没有运行到末尾，仍会终止并判分。

## 提示

变量不会溢出。程序使用 `int` 类型存储格子里的数据，想要溢出至 $0$ 需进行 $4294967294$ 次操作 $1$，必然超时。

保证开始时，内存条与迭代条中数据全是 $0$，其他内存区域不为负数。

>cz: 有符号整数溢出？
你认真的？

## 时空限制

时间限制: 1000 ms
内存限制: 128 MB
