# 【CJLOI R1】long卷蜂

## 题目描述

初始时，在 $(0,0)$ 位置，有一群蜂。你可以将初始时的蜂群视为半径为 $0$ 的圆。

突然，他们似乎受到了来自 flower 的神秘刺激，开始移动，同时不断扩张。

具体的，从 $0$ 时刻起，这群蜂的半径每 $1$ 单位时间就会增加 $a$ 单位距离，并且这群蜂的圆的圆心向着一个方向匀速直线运动，每 $1$ 单位时间移动 $v$ 单位距离。

经过 $t$ 单位时间，flower 逃离了这群蜂，于是他们停止了移动，也停止了扩张。

请问在这段时间内，有多大单位面积的区域被这群蜂覆盖到过？

## 输入格式

**本题有单测试点内有多组测试数据。**

第一行一个整数 $T$,表示数据组数。

对于每组数据，一行三个整数 $v,a,t$，其意义见题面。

## 输出格式

对于每组数据，一行一个实数，表示被这群蜂覆盖到过的区域的面积。

你的答案会被判为正确当且仅当你的答案和标准答案的相对误差不超过 $10^{-4}$。

## 提示

### 样例解释

样例一：显然是一个半径为 $0$ 的圆扫过一定长度，答案为 $0$。

样例二：显然是一个半径为 $1$ 的圆，答案为 $\pi$。

### 数据范围

保证所有的输入数据均为整数。

对于所有数据，保证 $1 \le T \le 10^4,0 \le v,a,t \le 10^3$。

具体的数据范围如下表所示:

| 测试点编号 |   $T$   |   $v$   |   $a$   |   $t$   |
| :--------:  | :--------: | :--------: | :--------: | :--------: |
| $1\sim 5$   | $\le 10$    | $\le 5$    | $\le 5$    | $\le 5$    |
| $6\sim 9$ | $\le 10^4$ | $\le a$    | $\le 10^3$ | $\le 10^3$ |
| $10\sim 13$ | ^ | $\le 10^3$ | $\le v$    | ^ |
| $14\sim 16$ | $\le 1$    | ^ | $\le 10^3$ | ^ |
| $17\sim 20$ | $\le 10^4$ | ^ | ^ | ^ |

## 时空限制

时间限制: 1000 ms
内存限制: 512 MB
