# 【CJLOI R1】IOIers And Teachers

## 题目描述

本题的输入是一个故事，十分生动形象。具体的来说，有以下 $5$ 种不同的重点事件是你需要重点关注的：

1. 有人打开了 florr.io，这时输入形如 `%s opened florr.io`，不保证此时这个人没打开 florr.io。
2. 有人关闭了 florr.io，这时输入形如 `%s closed florr.io`，不保证此时这个人打开着 florr.io。
3. 有一个老师进来了，这时输入形如 `%s comes in`，不保证此时这个老师不在机房中。
4. 有一个老师离开了，这时输入形如 `%s goes out`，不保证此时这个老师在机房中。
5. 切换视角到另一个机房，这时输入形如 `in computer room %d`，不保证和切换视角前不在同一个机房中。

如果一个打开了 florr.io 的 IOIer 和任意一个老师处在同一间机房，那么这个 IOIer 会被发现在摸鱼，并被标记处罚。

当然了，因为一堆子的“不保证”，你可以将这些指令理解为命令性的，或者说是强制设置性的。

不过还有若干件事情是你需要注意的：

1. IOIers 首先是 OIers，他们的机房不会发生变动，我们会提前告诉你每一个 IOIers 的姓名以及他们所在的机房的编号。
2. 老师则是相对自由的，他们可以在不同的机房之间游离。
3. 如果我先在某一个机房告诉你一个老师进来了，随后我切换机房并且告诉你同一个老师又进来了，那么这个老师会先离开前一个机房，随后进入这个机房。
4. 老师离开机房是强制性指令，也就是不论这个老师当前在不在你视角所在的机房，他都会退出机房，并且不处于任何一个机房中（你可以理解为老师走到了走廊上）。
5. 最开始时你在编号为 $1$ 的机房中。

当然了，由于各种神奇的信息干扰，你所记录的日志当中会有各种其余的神奇的信息，不过可以保证这些信息的子串当中不会出现上面有的“句式”。

## 输入格式

第一行三个整数 $n,m,k$，表示故事有 $n$ 行，共有 $m$ 个 IOIers，$k$ 个老师。

接下来 $m$ 行，每行依次输入一个**纯英文大写字母**的字符串 $S_i$ 和一个数字 $c_i$，表示第 $i$ 个 IOIers 名叫 $S_i$，处在编号为 $c_i$ 的机房。保证 $S_i$ 不重。

接下来 $k$ 行，每行输入一个**纯英文小写字母**的字符串 $s_i$，表示第 $i$ 个老师名叫 $s_i$。保证 $s_i$ 不重。

接下来 $n$ 行，每行输入格式如上文给出。为防止 Windows 环境下生成数据对答案造成影响，**我们会在行末加上一个特殊字符 `@`**。保证特殊字符只会出现在行末。

注意：本题的字符集包括可见字符、空格和换行。

## 输出格式

首先，先输出若干行英文大写字符串，表示被标记处罚的 IOIers 的名字，每行一个，按照输入的顺序输出。

接着，如果所有人都被标记处罚了，那么输出一行 `bad,bad,bad ioers!!!`；  
如果所有人都没有被标记处罚，那么输出一行 `good,good,good OIers!!!`；  
不满足以上两种情况的则输出一行 `ioers | OIers???`。

## 提示

对于 $20\%$ 的数据，保证 $n\le200,m,k\le10$。

对于所有数据，保证 $n\le2.5\times10^5,m,k\le100$，老师和学生的名字长度小于等于 $10$。

现实中这些信息可能塞满 $50GiB$ 的存储空间，不过这道题的输入量保证在 $5MiB$ 及以下。

## 时空限制

时间限制: 1000 ms
内存限制: 512 MB
