# 0x14-Hash-necklace

## 题目描述

有一天，袁☆同学绵了一条价值连城宝石项链，但是，一个严重的问题是，他竟然忘记了项链的主人是谁！在得知此事后，很多人向☆同学发来了很多邮件，都说项链是自己的，要求他归还（显然其中最多只有一个人说了真话）。 ☆同学要求每个人都写了一段关于自己项链的描述： 项链上的宝石用数字0至9来标示。一个对于项链的表示就是从项链的某个宝石开始，顺指针绕一圈，沿途记下经过的宝石，比如如下项链： 1-2-3-4  它的可能的四种表示是0123、1230、2301、3012。 袁☆同学现在心急如焚，于是他找到了你，希望你能够编一个程序，判断两个给定的描述是否代表同一个项链（注意，项链是不会翻转的）。。

## 输入格式

给定两个项链的表示，判断他们是否可能是一条项链。输入文件只有两行，每行一个由0至9组成的字符串，描述一个项链的表示（保证项链的长度是相等的）。

## 输出格式

如果两条项链不可能同构，那么输出’No’，否则的话，第一行输出一个’Yes’，第二行输出该项链的字典序最小的表示。

## 提示

设L = 项链长度， 对于50%的数据L <= 100000； 对于100%的数据L <= 1000000。

## 时空限制

时间限制: 1000 ms
内存限制: 512 MB
