# O姬艹题解

## 题目描述

O姬抄袭题解的技术为 $a$，管理的发现能力为 $b$，求OJS 被发现的概率。其规律如下：
| $a-b$ | $成功率$ |
| -----------: | -----------: |
| $5$ | $50%$ |
| $4$ | $60%$ |
| $3$ | $70%$ |
| $2$ | $80%$ |
| $1$ | $90%$ |
| $0$ | $100%$ |

-------------
~~其实概率永远为 $0$。~~

-----------------------------
反之则输出`qwq`。

**注意：$a$、$b$ 如果其中一个为负数，则绝对`qwq`！**

## 输入格式

两行，每行一个整数，分别表示：

$a$

$b$

## 输出格式

如上（一行），为 O姬 被发现的概率。

## 提示

$a$、$b$ 不超过 $1000$ 位。（保证真实！）

## O姬 艹题解在 luogu 浑水摸鱼 $114514$ 年，从来没棕过！！

## 时空限制

时间限制: 500 ms
内存限制: 64 MB
