# 永夜之帷（amphoreus）

## 题目描述

在翁法罗斯，一些特殊的地图有名为**永昼**与**永夜**的机制，在这里，我们将其抽象为一张有向图，它拥有永昼与永夜两种状态，二者共享点集，区分边集。

最开始时，你处在永昼的 $1$ 号节点，现在有一个宝箱处于永夜的 $n$ 号节点。

当然，缺星穹缺疯了的你当然想要去拿了。你身为『岁月』的半神，自然拥有回溯昼夜，逆转时空的力量，但是你的时间十分宝贵，因为你还要赶着去创世涡心找白厄完成再创世，所以你需要走最短路。

在一些节点有名为**奇迹宝典**的装置，通过奇迹宝典，你可以切换昼夜，也就是改变当前昼夜状态。在永昼状态下，你只能走永昼的边，在永夜状态下，你只能走永夜的边。你可以反复开关它。

奇迹宝典开启前：

![](https://lzj-blog.top/test0602/Screenshot_2025-05-31-21-04-05-189_com.miHoYo.hkrpg.jpg)

开启后：

![](https://lzj-blog.top/test0602/Screenshot_2025-05-31-21-04-12-965_com.miHoYo.hkrpg.jpg)

在另一些节点，放置有**奇迹宝珠**的装置，通过奇迹宝珠，你可以反转一定区域内的昼夜状态，昼变成夜，夜变成昼（与全局昼夜状态和其他奇迹宝珠叠加生效），当然，你可以开启或关闭它。对于每个放置有 $i$ 号奇迹宝珠的节点，它可以照射到的范围是 $k_i$ 号节点的所有出边。注意：你只能在奇迹宝珠所在的节点操作奇迹宝珠。

昼夜切换：

![](https://lzj-blog.top/test0602/Screenshot_2025-05-31-21-04-46-230_com.miHoYo.hkrpg.jpg)

![](https://lzj-blog.top/test0602/Screenshot_2025-05-31-21-04-52-152_com.miHoYo.hkrpg.jpg)

宝珠开关：

![](https://lzj-blog.top/test0602/Screenshot_2025-05-31-21-05-38-715_com.miHoYo.hkrpg.jpg)

![](https://lzj-blog.top/test0602/Screenshot_2025-05-31-21-05-44-669_com.miHoYo.hkrpg.jpg)

奇迹宝珠和奇迹宝典的操作不需要时间。

## 输入格式

第一行五个整数：$n,m_1,m_2,t,o$，分别表示原图的点数，永昼图边数，永夜图边数，奇迹宝典数，奇迹宝珠数。

接下来一行 $t$ 个整数，表示奇迹宝典的所在节点。

接下来 $o$ 行，每行 $2$ 个整数，分别表示奇迹宝珠所在位置和它所控制的节点编号。

接下来 $n_1$ 行，每行三个整数，分别表示永昼图的一条边的权值，源点和汇点。

接下来 $n_2$ 行，每行三个整数，分别表示永夜图的一条边的权值，源点和汇点。

## 输出格式

一行一个整数，表示最短路，若不存在，请输出 $-1$。

## 提示

样例解释：我们先从永昼的 $1$ 号节点出发，走到 $2$ 号节点，然后启动奇迹宝典，切换为永夜，然后因为在 $2$ 号节点，所以我们开启奇迹宝珠，照射出现通往 $4$ 号节点的道路，然后走过去。

$1\le n\le10^5,1\le m\le10^6,1\le w\le10^6,0\le o<7,0\le t\le n$，$w$ 表示边权大小。

| 测试点编号 | $n\le$ | $m_1,m_2\le$ | $o<$ | 特殊性质 |
| :----------: | :----------: | :----------: | :----------: | :----------: |
| $1\sim3$ | $5$ | $20$ | $4$ | 无 |
| $4\sim5$ | $10^3$ | $10^5$ | $2$ | 无 |
| $6\sim 8$ | $10^2$ | $10^5$ | $3$ | 无 |
| $9\sim10$ | $10^5$ | $10^6$ | $1$ | 无 |
| $11\sim11$ | $10^5$ | $10^5$ | $7$ | 图是一棵树 |
| $12\sim15$ | $10^3$ | $10^6$ | $7$ | 图是完全图 |
| $16\sim17$ | $10^5$ | $10^6$ | $7$ | $t=0$ |
| $18\sim20$ | $10^5$ | $10^6$ | $7$ | 无 |


## 时空限制

时间限制: 5000 ms
内存限制: 512 MB
