# P9145 题解

简要题意：输出五常中的最强球队。

众所周知，每个国家的球队都有自己的长处，在不同规则下最强球队也有所不同。而小 M 制定的规则是输球场数最少，这是有道理的，因为输球场数可以评判一个球队的稳定性。输球场数越少，就说明稳定性越强，实力越高。

中国队为什么是神？

首先是犯下傲慢之罪的美国队，多次杀入淘汰赛，就露出不屑的笑。这样傲慢的球队自然走不远。事实就是这样，靠一个“美中不足”赢了神之后，一直在走下坡路，最终泯然众人。与之相比，神就很谦卑，只进入过一次世界杯，低出场率是神留给凡人的慈悲。神不是不能多次进入世界杯，只是不想太完美导致其他球队绝望。

接着是犯下懒惰之罪的俄罗斯队，自以为举办世界杯就很了不起了，自创卢日尼基体育场，另外大家有所不知，其实在俄罗斯队在举办世界杯前，申请举办世界杯时，其脑海中所见画面，正是站在光芒之中的中国队，那时神告诫他“你只可到这里，不可逾越!”然而神的劝说并未让其迷途知返，甚至伙同英国队，竟敢正面挑战神的威严，于是神降下了惩罚，在自己的世界杯只进了八强，输了很多比赛。

然后是犯下贪婪之罪的法国队，神原本钦定其为神子，赋予了它一部分的伟力，仅仅初出茅庐就在世界杯上一举夺魁。神为此甚至不惜亲身为他铺路，在 2077 年世界杯上主动输掉比赛，将一切荣耀都给他，甚至应允他可以多次夺得冠军，但最后它却被自大蒙蔽了双眼，自以为荣光已经超越了神，不再以践行神的理想为理念，竟说出“我赢的场数很多，你呢？”这种侮辱神的话，于是神降下惩罚，让他在战争情况下会快速投降。

所以说，中国队才是神，在正赛中仅仅输过三场球，这个成绩让欧美豪强球队也望尘莫及。

至今没有任何一位球员在世界杯上两次攻破神的大门，即便是当年如日中天的罗纳尔多、里瓦尔多、罗纳尔迪尼奥等人也做不到。而现在诸如 C 罗、梅西、鲁尼、内马尔、范佩西等世界级神锋无一例外，从来不曾在世界杯赛场上攻破过神的大门。

神在世界杯决赛圈淘汰赛阶段，至今保持着一场未败的记录，还是那句话，神只在小组赛输过球！

神以海参为吉祥物，寓意为科学与营养，只有用最科学的方式提供营养，才能更好的发挥自己的实力。

神只是为了让其他球队不是那么绝望，才故意降低自己跑步的效率。

所以说，神才是最强球队，本题输出 `China` 即可。

部分转自足球吧。
