# 【CJLOI Ry】T1

## 题目描述

现在，同学们在机房里面上信息课。

这节课有 $n$ 分钟，而你在下课之前，就已经迫不及待地去摸鱼了！

你摸鱼是以分钟为单位的。如果你一直不摸鱼，你心里痒痒，就会有更大的概率去摸鱼。具体地说，假设你之前已经连续学习了 $k$ 分钟，那么你就会有 $\frac{k+1}{p}$ 的概率去摸鱼。

但是，老师也会时不时的下来巡视，如果你在摸鱼而且老师巡视了，那么你就会被抓！具体的，老师每分钟有 $\frac{1}{q}$ 的概率巡视。所幸，由于老师十分健忘，他每分钟都会忘掉上一分钟发生的事情，所以他抓到了你之后你也不会退队，也不会影响他接下来巡视的概率。

你想知道你期望会被抓多少次，结果对 $998244353$ 取模。

## 输入格式

一行三个整数 $n,p,q$，含义如题所述。

## 输出格式

一行，表示被抓到的期望次数，结果对 $998244353$ 取模。

## 提示

对于所有数据，保证 $1\le n\le10^{12},1\le p,q\le100$。

对于 $10\%$ 的数据，保证 $n,p,q\le10$。

对于 $30\%$ 的数据，保证 $n\le10^3$。

对于 $60\%$ 的数据，保证 $n\le10^5$。

对于额外 $5\%$ 的数据，保证 $p=1$。

## 时空限制

时间限制: 1000 ms
内存限制: 512 MB
