# 字符串 Hash（数据加强）

## 题目描述

给定 $n$ 个字符串，判断不同的字符串有多少个。

**如果真的想练习 Hash，请好好做。**

## 输入格式

第一行包括一个整数 $n$，表示字符串的个数。

接下来共 $n$ 行，每行一个字符串。

## 输出格式

一行一个整数，表示不同的字符串个数。

## 提示

设第 $i$ 个字符串长度为 $m_i$。

本题评测由三个子任务构成：

第一个子任务（卡大模数 Hash）：
| 测试点 | $n = $ | $m_i = $ |
| :-----------: | :-----------: | :-----------: |
| $1\sim 6$ | $10^6$ | $6$ |

第二个子任务（卡底数为偶数的自然溢出 Hash）：

| 测试点 | $n=$ | $m_i\approx$ | $m_{max}=$ |
| :-----------: | :--------: | :--------------: | :------------: |
| $1\sim 6$ | $10^4$ | $1000$ | $1500$ |

第三个子任务：（卡奇数底数哈希）

|   测试点   |   $n=$   | $m_i\approx$ |
| :---------: | :--------: | :------------: |
| $1\sim 6$ | $2^{11}+1$ |   $2^{11}$   |

可参考：[https://codeforces.com/blog/entry/60442](https://codeforces.com/blog/entry/60442)

中文：[https://xglight.netlify.app/posts/951dcf71/](https://xglight.netlify.app/posts/951dcf71/)

## 时空限制

时间限制: 1000 ms
内存限制: 512 MB
